In [5]:
import pandas as pd
df = pd.read_csv('Employees.csv',index_col="ID")
df

        Name  Age Department  salary
ID
11  Arshiyan   22         HR    50000
22    Kashif   20    FINANCE     6000
33     hamza   18         HR    70000
44     umair   17         IT     8000
55     Babar   27       TECH    54433

In [23]:
df = pd.read_csv('Employees.csv',usecols=['Name','salary '])
df

       Name  salary
0  Arshiyan    50000
1    Kashif     6000
2     hamza    70000
3     umair     8000
4     Babar    54433

In [17]:
df2 = pd.read_csv("Employees.csv",dtype={"Age":str})
print("wait...")
print("successfully converted age to string")
print("The updated data typw of Age is: ",df2["Age"].dtype)

wait...
successfully converted age to string
The updated data typw of Age is:  object

In [24]:
import pandas as pd

data = {
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Monitor'],
    'Price': [800, 500, 300, 200],
    'Stock': [50, 100, 150, 75]
}

df = pd.DataFrame(data)
df

      Product  Price  Stock
0      Laptop    800     50
1  Smartphone    500    100
2      Tablet    300    150
3     Monitor    200     75

In [25]:
with_index = df.to_csv("products.csv")
print("successfully saved with indexes")

successfully saved with indexes

In [29]:
without_index = df.to_csv("products_no_index.csv",index=False)
print("successfully saved without indexes")

successfully saved without indexes

In [30]:
certain = df.to_csv('ceratin.csv',sep=';',columns=["Product","Price"])
print("success")

success

In [3]:
import pandas as pd
pd.read_csv("Employees.csv",nrows=2)

   ID      Name  Age Department  salary
0  11  Arshiyan   22         HR    50000
1  22    Kashif   20    FINANCE     6000